#include <stdio.h>
#include <locale.h>
#include <time.h>
#include <stdlib.h>
#define _CRT_SECURE_NO_WARNINGS
#define SIZE 26




int main(void)
{
	setlocale(LC_ALL, "RUS");
// Задание 1 -----------------------------------------------------------
	//int a = 7, b = 5;
	//float res = (float)a / b;
	//setlocale(LC_ALL, "RUS");
	//printf("%20s\n", "Это текст");
	//printf("\t%5s\n", "Это текст");
	//printf("%5.5f\n ", 12.234657);
	//printf("Остаток от деления %d на %d равен %d\n ", 5, 2, 5 % 2);
	//printf("Результат от деления %d на %d равен %2.1f\n ", a, b, res);
	
// Задание 1 -----------------------------------------------------------

// Задание 2 -----------------------------------------------------------
	int N, K;

	N = 13;
	K = 24;
	printf("Сейчас %d часов %d минут 0 секунд\n", N, K);
	printf("Идёт %d минута суток\n", N * 60 + K+1);
	printf("До полуночи осталось %d часа и %d минут\n", (1440 - (N * 60 + K)) / 60, (1440 - (N * 60 + K)) % 60);
	printf("С 8.00 прошло %d секунд\n", ((((N * 60 + K)) * 60) - 480*60));
	printf("Текущий час  = %f суток  и текущая минута = %f часа\n", N / 24., K/60.);
	return 0;

// Задание 2 -----------------------------------------------------------

// Задание 3 -----------------------------------------------------------
	//float n, k, m;
	//n = 3;
	//k = 4;
	//m = 2;
	//printf("Дано:\n\t %.0f\n\t 333\n\t __________\nОтвет:\n \t %+07.2f", n, (n / 333));
	//return 0;
// Задание 3 -----------------------------------------------------------
}